Revit 2024 API
IDuctFittingAndAccessoryPressureDropUIServer Interface
 Interface for external servers providing optional UI for duct fitting and duct accessory coefficient calculation.
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public interface IDuctFittingAndAccessoryPressureDropUIServer : IExternalServer
Visual Basic
Public Interface IDuctFittingAndAccessoryPressureDropUIServer _
	Inherits IExternalServer
Visual C++
public interface class IDuctFittingAndAccessoryPressureDropUIServer : IExternalServer
Remarks
 This service works with duct fitting and accessory pressure drop service. It provides the settings for the duct fitting and accessory pressure drop server if needed; and it also provides UI for user to input the settings in Revit. A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service.
See Also
IDuctFittingAndAccessoryPressureDropUIServer Members
Autodesk.Revit.UI.Mechanical Namespace